snlkuharlocal/src/InformationRegisters/БлокировкаВыдачиВНабор/БлокировкаВыдачиВНабор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БлокировкаВыдачиВНабор</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидСклада/ВидСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСклада</name>
  <enumValues>
    <name>Физический</name>
  </enumValues>
  <enumValues>
    <name>Виртуальный</name>
  </enumValues>
  <enumValues>
    <name>ВиртуальныйДляСклада</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистКассовойКниги/ЛистКассовойКниги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистКассовойКниги</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПКО</name>
    <attributes>
      <name>Касса</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Докоснование</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЦО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кассир</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Выдано</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Приложение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоДокументу</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПКО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РКО</name>
    <attributes>
      <name>Касса</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Докоснование</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЦО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кассир</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Выдано</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Приложение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоДокументу</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийРКО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/БлокировкаВыдачиВНабор/БлокировкаВыдачиВНабор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БлокировкаВыдачиВНабор</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <registerRecords>InformationRegister.БлокировкаВыдачиВНабор</registerRecords>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Инвентаризация</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаБлокировкиFBS</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаткиFBSОбнулены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяДействия</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СостоянияЗапрета</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СостоянияРезервирования</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗНБ</name>
    <attributes>
      <name>ЗаданиеНабора</name>
      <type>
        <types>DocumentRef.ЗаданиеНабора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/УправлениеДоступом/Module.bsl
Функция МожноИзменятьДокумент(ДокОбъект,Отказ=Ложь,ВыводитьСообщения=Ложь) Экспорт
	Если Отказ Тогда Возврат Ложь КонецЕсли; //И так все плохо
	
	Вид=ДокОбъект.Метаданные().Имя;	
	
	ЭтотУзел=ПланыОбмена.Основной.ЭтотУзел();
	//Можно=Истина;
		
	Если Вид="РасходнаяНакладная" Тогда		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда
				Если ДокОбъект.Ссылка.Отгружен=Перечисления.Отгружен.Отгружен И НЕ ПустаяСтрока(ДокОбъект.Склад.КодФизическогоУзла) Тогда
					Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");
				КонецЕсли;
			Иначе		
				Отказ=Истина;
			КонецЕсли;
			//крохин начало 16.02.2012
			//запретим редактировать филиальные РНК в офисе
			Если ДокОбъект.Склад.ТипСклада = Перечисления.ТипСклада.Филиал Тогда
				Если НЕ РольДоступна("Администратор") Тогда
			Отказ = Истина;	
			КонецЕсли;	
			КонецЕсли;
			//крохин конец 16.02.2012
		Иначе			
			Если РольДоступна("Администратор") Тогда
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорСклад") Тогда		
				Если ДокОбъект.Ссылка.Отгружен=Перечисления.Отгружен.Отгружен Тогда
					Если ДокОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
						Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");
					Иначе
						Отказ=Истина; //На других узлах вообще нечего трогать чужие документы
					КонецЕсли;					
				КонецЕсли;			
			Иначе		
				Отказ=Истина;
			КонецЕсли;
			//крохин начало 16.02.2012
			//запретим редактировать офисные РНК в филиале
			//крохин начало 25.05.2012
			//Вэймарт
			//Если ДокОбъект.Склад.ТипСклада <> Перечисления.ТипСклада.Филиал И  ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			//Катаев+ 10/06/14 Для филиала проверку по досупу к скадам делаем по коду узла
			Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			//Если (ДокОбъект.Склад.ТипСклада <> Перечисления.ТипСклада.Филиал И ДокОбъект.Склад.ТипСклада <> Перечисления.ТипСклада.ОптовыйТЦ) И  ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			////крохин конец 25.05.2012	
			//	
			////крохин начало 22.05.2012
			////Отказ = Истина;
			//Если ДокОбъект.Склад.Пустая() Тогда
			//	Отказ = Ложь;
			//Иначе
			//Если НЕ РольДоступна("Администратор") Тогда
			//Отказ = Истина;	
			//КонецЕсли;
				Если ДокОбъект.Склад.Пустая() Тогда
					Отказ = Ложь;
				ИначеЕсли ПланыОбмена.Основной.ЭтотУзел().Код <> ДокОбъект.Склад.КодФизическогоУзла Тогда
					Если НЕ РольДоступна("Администратор") Тогда
						Отказ = Истина;	
					КонецЕсли;
				
				КонецЕсли;
				//Катаев- 10/06/14
			//крохин конец 22.05.2012
			КонецЕсли;
			//крохин конец 16.02.2012

		КонецЕсли;		
	ИначеЕсли Вид="Перемещение" Тогда
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если ДокОбъект.Склад.ФизическийСклад=ДокОбъект.СкладПолучатель ИЛИ ДокОбъект.Склад=ДокОбъект.СкладПолучатель.ФизическийСклад Тогда //виртуальные перемещения на КБ
				Возврат НЕ Отказ;
			КонецЕсли;
			
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда					
				ЕстьВиртуальныеСклады=Ложь;
				Если ДокОбъект.Склад.ВидСклада=Перечисления.ВидСклада.Виртуальный ИЛИ ДокОбъект.СкладПолучатель.ВидСклада=Перечисления.ВидСклада.Виртуальный Тогда
					ЕстьВиртуальныеСклады=Истина;				
				КонецЕсли; 
				Если
						(НЕ ПустаяСтрока(ДокОбъект.Склад.КодФизическогоУзла) 			И ДокОбъект.Ссылка.Отгружен=Перечисления.Отгружен.Отгружен) //накладная реально отгружена складом
					ИЛИ (НЕ ПустаяСтрока(ДокОбъект.СкладПолучатель.КодФизическогоУзла)	И ДокОбъект.Ссылка.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята) //накладная реально принята складом
					Тогда
					Если ЕстьВиртуальныеСклады Тогда
						Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженыхПеремещенийНаВирутальныеСклады");
					Иначе
						Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");					
					КонецЕсли;					
				КонецЕсли;
			Иначе		
				Отказ=Истина;
			КонецЕсли;			
		Иначе
			Если РольДоступна("Администратор") Тогда
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорСклад") Тогда		
				Если 
						ДокОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И ДокОбъект.Ссылка.Отгружен=Перечисления.Отгружен.Отгружен //накладная реально отгружена складом						
					ИЛИ ДокОбъект.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И ДокОбъект.Ссылка.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята //накладная реально принята складом
					Тогда
					Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");
										//крохин начало 29.03.2013
				//в филиалах можно по другой галке редактировать перемещения между своими складами
				Если ДокОбъект.Склад.КодФизическогоУзла=ДокОбъект.СкладПолучатель.КодФизическогоУзла Тогда
					Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженыхПеремещенийНаВирутальныеСклады");
				КонецЕсли;
				//крохин конец 29.03.2013
				КонецЕсли;			
			Иначе		
				Отказ=Истина;
			КонецЕсли;	
		КонецЕсли;		
	ИначеЕсли Вид="ПриходнаяНакладная" Тогда		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда				
				Если ДокОбъект.Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Принята И НЕ ПустаяСтрока(ДокОбъект.Склад.КодФизическогоУзла) Тогда				
					Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеПринятыхНакладных");					
				КонецЕсли;
			Иначе		
				Отказ=Истина;
			КонецЕсли;			
		Иначе
			Если РольДоступна("Администратор") Тогда					
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорСклад") Тогда		
				Если ДокОбъект.Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Принята Тогда
					Если ДокОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
						Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеПринятыхНакладных");
					Иначе
						Отказ=Истина;
					КонецЕсли;					
				КонецЕсли;			
			Иначе		
				Отказ=Истина;
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Вид="СписаниеТМЦ" Тогда		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда				
				Если ДокОбъект.Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена И НЕ ПустаяСтрока(ДокОбъект.Склад.КодФизическогоУзла) Тогда				
					Отказ=НЕ ПолучитьПолномочиеПользователя("ИспользованиеИнвентаризаций");
				КонецЕсли;
			Иначе		
				Отказ=Истина;
			КонецЕсли;			
		Иначе
			Если РольДоступна("Администратор") Тогда					
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорСклад") Тогда		
				Если ДокОбъект.Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда
					Отказ=НЕ ПолучитьПолномочиеПользователя("ИспользованиеИнвентаризаций");
				КонецЕсли;			
			Иначе		
				Отказ=Истина;
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Вид="ПродажаИМ" Тогда		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда
				
				Если ДокОбъект.Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Доставлена И НЕ ПустаяСтрока(ДокОбъект.Склад.КодФизическогоУзла) Тогда
					Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");
				КонецЕсли;
				
				
			Иначе		
				Отказ=Истина;
			КонецЕсли;			
		Иначе			
			Если РольДоступна("Администратор") Тогда
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорСклад") Тогда		
				
				Если  ДокОбъект.Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Доставлена И ДокОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					Отказ=Истина;  //НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");
					
				Иначе 
					Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных");
					
				КонецЕсли;			
							
			Иначе		
				Отказ=Истина;
			КонецЕсли;	
		КонецЕсли;
		
	
	КонецЕсли;	
	
	Если Отказ И ВыводитьСообщения Тогда
		Сообщить("Недостаточно полномочий для модификации документа !",СтатусСообщения.Важное);	
	КонецЕсли;	
	Возврат НЕ Отказ;
КонецФункции // МожноИзменятьДокумент()

//крохин начало 14.06.2012
Функция МожноИзменятьКассовыйДокумент(ДокОбъект) Экспорт
	//проверим наличие непустых листов с датой больше или равной документу
	 //крохин начало 15.06.2012
	//Вэймарт может изменять кассу текущей датой
	//крохин начало 05.07.2012
	//теперь и Семеновский тоже
	//Если ПараметрыСеанса.ЭтотУзел.Подразделение.код = "SSP-0009" Тогда
	Если ПараметрыСеанса.ЭтотУзел.Подразделение.код = "SSP-0009" ИЛИ ПараметрыСеанса.ЭтотУзел.Подразделение.код = "SSP-0004" Тогда
	//крохин конец 05.07.2012	
	ДатаЛиста = НачалоДня(ДокОбъект.Дата)+24*60*60;
Иначе
	ДатаЛиста = НачалоДня(ДокОбъект.Дата);
	КонецЕсли;
	//крохин конец 15.06.2012
	
	//крохин начало 18.06.2012
	//временно разрешим в офисе
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	возврат Истина;
	КонецЕсли;
	//крохин конец 18.06.2012

		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистКассовойКнигиПКО.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛистКассовойКниги.ПКО КАК ЛистКассовойКнигиПКО
	               |ГДЕ
	               |	ЛистКассовойКнигиПКО.Ссылка.Дата >= &ДатаЛиста
	               |	И ЛистКассовойКнигиПКО.Ссылка.Подразделение = &Подразделение
	               |	И ЛистКассовойКнигиПКО.Ссылка.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛистКассовойКнигиПКО.Ссылка.Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаЛиста",ДатаЛиста);
	Запрос.УстановитьПараметр("Подразделение",ДокОбъект.Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить("Существует заполненный лист кассовой книги за " + Формат(ДатаЛиста,"ДЛФ=D")+". Редактирование невозможно");
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистКассовойКнигиРКО.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛистКассовойКниги.РКО КАК ЛистКассовойКнигиРКО
	               |ГДЕ
	               |	ЛистКассовойКнигиРКО.Ссылка.Дата >= &ДатаЛиста
	               |	И ЛистКассовойКнигиРКО.Ссылка.Подразделение = &Подразделение
	               |	И ЛистКассовойКнигиРКО.Ссылка.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛистКассовойКнигиРКО.Ссылка.Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаЛиста",ДатаЛиста);
	Запрос.УстановитьПараметр("Подразделение",ДокОбъект.Подразделение);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщить("Существует заполненный лист кассовой книги за " + Формат(ДатаЛиста,"ДЛФ=D")+". Редактирование невозможно");
		Возврат Ложь;
	КонецЕсли;
	
    Возврат Истина;
	
КонецФункции
//крохин конец 14.06.2012

//ЭУ		- Элемент управления
//СтрокаТД	- строка таблицы доступа
Процедура УстановитьПараметрыДоступаЭУ(Форма,ЭУ,СтрокаТД)	
	Если ЭУ.Доступность И СтрокаТД.Доступность<>Неопределено Тогда
		ЭУ.Доступность=СтрокаТД.Доступность;					
	КонецЕсли;				
	Если СтрокаТД.ТолькоПросмотр<>Неопределено Тогда
		Попытка
			ЭУ.ТолькоПросмотр	=СтрокаТД.ТолькоПросмотр;					
		Исключение			
			ЭУ.Доступность		=?(СтрокаТД.ТолькоПросмотр,Ложь,Истина);			
		КонецПопытки;		
	КонецЕсли;				
	Если СтрокаТД.Видимость<>Неопределено Тогда
		Если ТипЗнч(ЭУ)=Тип("Надпись") Тогда
			ЭУ.Видимость=СтрокаТД.Видимость;
		Иначе
			//скрытые элементы не отображаем чтобы не портить картину
			//закрытые выключаем
			Если НЕ СтрокаТД.Видимость И ЭУ.Видимость Тогда
				ЭУ.Видимость=СтрокаТД.Видимость;		
				Попытка
					ЭУ.ИзменятьВидимость=Ложь;
				Исключение
				КонецПопытки;			
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаТД.ВозможныеЗначения) Тогда				
		НачЗнач	=ЭУ.Значение;
		НачМод	=Форма.Модифицированность;
		
		ЭУ.СписокВыбора=ЗначениеИзСтрокиВнутр(СтрокаТД.ВозможныеЗначения);		
		ЭУ.РежимВыбораИзСписка=Истина;	
		ЭУ.КнопкаВыбора=Ложь;
		
		ЭУ.Значение=НачЗнач;
		
		Форма.Модифицированность=НачМод;
	КонецЕсли; 
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// РАБОТАЕТ И НА ФОРМЕ ОБЪЕКТА, И НА ФОРМЕ СПИСКА!!!!!
// Переделал на Функцию (нужны возвращаемые значения)
///////////////////////////////////////////////////////////////////////////////////////////////////
Функция УстановитьДоступностьРеквизитов(Форма, ТипФормы = "") Экспорт
	
	СтруктураДоступности = ПолучитьТаблицуДоступностиПолей(Форма, Неопределено, ТипФормы);
	ТД = СтруктураДоступности.ТД;
	
	Если ТД.Количество()=0 Тогда
		#ЕСЛИ КЛИЕНТ ТОГДА
		Сообщить("Невозможно определить права доступа объекта !");
		#КОНЕЦЕСЛИ
		Форма.ТолькоПросмотр=Истина;
		Возврат СтруктураДоступности;
	КонецЕсли;
	
	Если ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Объект = ДанныеФормыВЗначение(Форма.Объект, Тип(ТипФормы));
		МетаОбъект	= Объект.Метаданные();
		ТипОбъекта	= ТипОбъекта(Объект);
		ЭлементыФормы = Форма.Элементы;
	ИначеЕсли ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЭтотОбъект") Тогда
		Объект		= Форма.ЭтотОбъект;
		МетаОбъект	= Объект.Метаданные();
		ТипОбъекта	= ТипОбъекта(Объект);
		ЭлементыФормы = Форма.ЭлементыФормы;
	Иначе
		Возврат СтруктураДоступности;
	КонецЕсли;
	
	Для Каждого СтрокаТД Из ТД Цикл	
		Если СтрокаТД.ТипРаздела="Шапка" Тогда
			
			Если СтрокаТД.ИмяРеквизита="*.*" Тогда //Все				
				Для Каждого ЭУ Из ЭлементыФормы Цикл
					
					Если ТипЗнч(ЭУ) = Тип("ГруппаФормы") ИЛИ ТипЗнч(ЭУ) = Тип("ДекорацияФормы")
						ИЛИ ТипЗнч(ЭУ) = Тип("КнопкаФормы") Тогда
						Продолжить;
					КонецЕсли;
					
					// ЭУ.Данные, УФ - ЭУ.Имя
					Попытка
						Данные = ЭУ.Данные;
					Исключение
						Данные = ЭУ.Имя;
					КонецПопытки;
					
					ЭтоРеквизитОбъекта = Ложь;
					Если (НЕ ПустаяСтрока(Данные) И Найти("Номер,Дата,Код,Наименование,Родитель,Владелец",Данные)<>0) ИЛИ 
						МетаОбъект.Реквизиты.Найти(Данные) <> Неопределено  Тогда
						ЭтоРеквизитОбъекта = Истина;					
					//ИначеЕсли ЭУ.ИзменяетДанные Тогда
					//	ЭтоРеквизитОбъекта=Ложь;	
					Иначе //не реквизит и данных не меняет на фиг сдался
						Продолжить;
					КонецЕсли; 
					
					Если СтрокаТД.ИмяРаздела="Реквизиты" И НЕ ЭтоРеквизитОбъекта Тогда Продолжить КонецЕсли; 
					Если СтрокаТД.ИмяРаздела="ЭУ" И ЭтоРеквизитОбъекта Тогда Продолжить КонецЕсли; 
					
					УстановитьПараметрыДоступаЭУ(Форма,ЭУ,СтрокаТД);					
				КонецЦикла; 
				ЭлементУправления=Неопределено;
			Иначе
				ЭлементУправления=ЭлементыФормы.Найти(СтрокаТД.ИмяРеквизита);
			КонецЕсли;			
		ИначеЕсли СтрокаТД.ТипРаздела="ТЧ" Тогда
			Если ТипОбъекта="Справочник" И Объект.Метаданные().Имя <> "Номенклатура" Тогда
				Если МетаОбъект.ТабличныеЧасти.ВидыДопОбработок.Использование=Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И НЕ Объект.ЭтоГруппа Тогда
					Возврат СтруктураДоступности;
				ИначеЕсли МетаОбъект.ТабличныеЧасти.ВидыДопОбработок.Использование=Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда
					Возврат СтруктураДоступности;				
				КонецЕсли;			
			КонецЕсли; 
			
			Если СтрокаТД.ИмяРеквизита="*.*" Тогда //Все
				Для Каждого КолонкаТЧ Из ЭлементыФормы[СтрокаТД.ИмяРаздела].Колонки Цикл
					УстановитьПараметрыДоступаЭУ(Форма,КолонкаТЧ,СтрокаТД);							
				КонецЦикла;		
				ЭлементУправления=Неопределено;				
				
				ИмяКП="кп"+СтрокаТД.ИмяРаздела;
				
				ЭУ=ЭлементыФормы.Найти(СтрокаТД.ИмяРаздела);
				Если ЭУ <> Неопределено Тогда
					ЭУ.ИзменятьСоставСтрок = СтрокаТД.ИзменятьСоставСтрок;				
				КонецЕсли;				
				
				кпТЧ = ЭлементыФормы.Найти(ИмяКП);
				Если кпТЧ <> Неопределено Тогда					
					Если кпТЧ.Кнопки.Найти("ПодборПоУмолчанию")<>Неопределено Тогда
						кпТЧ.Кнопки.ПодборПоУмолчанию.Доступность		=СтрокаТД.ИзменятьСоставСтрок;				
						Для Каждого Кнопка Из кпТЧ.Кнопки.ПодменюПодбор.Кнопки Цикл
							Кнопка.Доступность							=СтрокаТД.ИзменятьСоставСтрок;				
						КонецЦикла;
					КонецЕсли; 
					
					Если кпТЧ.Кнопки.Найти("ЗаполнитьПоУмолчанию")<>Неопределено Тогда
						кпТЧ.Кнопки.ЗаполнитьПоУмолчанию.Доступность	=СтрокаТД.ИзменятьСоставСтрок;				
						
						Для Каждого Кнопка Из кпТЧ.Кнопки.ПодменюЗаполнить.Кнопки Цикл
							Кнопка.Доступность							=СтрокаТД.ИзменятьСоставСтрок;				
						КонецЦикла;				
					КонецЕсли;			
				КонецЕсли;				
			Иначе				
				ЭлементУправления = ЭлементыФормы[СтрокаТД.ИмяРаздела].Колонки[СтрокаТД.ИмяРеквизита];
			КонецЕсли;
		КонецЕсли;	
		
		Если ЭлементУправления <> Неопределено Тогда
			УстановитьПараметрыДоступаЭУ(Форма,ЭлементУправления,СтрокаТД);
		КонецЕсли;		
	КонецЦикла;
	
	Возврат СтруктураДоступности;
	
КонецФункции 


Функция ПроверитьУсловие(НастройкаПрав,СтрокаОтбора,ДляНовых,Объект)
	// условие используется только для новых объектов если объект существует значит флай-вей
	Если ДляНовых Тогда
		Возврат Объект.Ссылка.Пустая()	
	КонецЕсли; 
	
	Постр=Новый ПостроительОтчета;
	
	НастройкаПравОбъект=НастройкаПрав.ПолучитьОбъект();
	НастройкаПравОбъект.НастроитьПостроитель(Постр,СтрокаОтбора);
	
	Постр.ВыбранныеПоля.Очистить();
	Постр.ВыбранныеПоля.Добавить("Ссылка");
	
	Постр.Параметры.Вставить("Ссылка",Объект.Ссылка);	
	Постр.Выполнить();	
	
	Если Постр.Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;	
	КонецЕсли;	
КонецФункции // ПроверитьУсловие()
 
Функция ПолучитьОграниченияДоступа(Объект, НеПроверятьТипУзла = Ложь)
	
	Тип		= ТипОбъекта(Объект);
	Вид		= Объект.Метаданные().Имя;
	
	ТипУзла	= ПланыОбмена.Основной.ЭтотУзел().ТипУзла;
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УсловияОбъекта.ТипУзла КАК ТипУзла,
	|	УсловияОбъекта.Ссылка КАК НастройкаПрав,
	|	УсловияОбъекта.Ссылка.Тип КАК Тип,
	|	УсловияОбъекта.Ссылка.Вид КАК Вид,
	|	УсловияОбъекта.ДляНовых КАК ДляНовых,
	|	УсловияОбъекта.СтрокаОтбора КАК СтрокаОтбора,
	|	УсловияОбъекта.ПредставлениеОтбора КАК ПредставлениеОтбора,
	|	УсловияОбъекта.ИД_Строки КАК ИД_СтрокиУсловий,
	|	УсловияОбъекта.Приоритет КАК Приоритет,
	|	УсловияОбъекта.ПроизвольноеУсловие КАК ПроизвольноеУсловие
	|ИЗ
	|	Справочник.НастройкиДоступа.УсловияОбъекта КАК УсловияОбъекта
	|ГДЕ
	|	УсловияОбъекта.Ссылка.Тип = &Тип
	|	И УсловияОбъекта.Ссылка.Вид = &Вид
	|	И НЕ УсловияОбъекта.Ссылка.ПометкаУдаления
	|	" + ?(НеПроверятьТипУзла, "", "И УсловияОбъекта.ТипУзла = &ТипУзла") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	УсловияОбъекта.Приоритет УБЫВ";
	 
	 Запрос.УстановитьПараметр("Тип",Тип);
	 Запрос.УстановитьПараметр("Вид",Вид);
	 Запрос.УстановитьПараметр("ТипУзла",ТипУзла);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл		 
		 Если ПроверитьУсловие(Выборка.НастройкаПрав,Выборка.СтрокаОтбора,Выборка.ДляНовых,Объект) Тогда
			 Возврат Новый Структура("СсылкаНаПравило,ИД_СтрокиУсловий,ТипУзла,ПроизвольноеУсловие",
			 	Выборка.НастройкаПрав,Выборка.ИД_СтрокиУсловий,Выборка.ТипУзла,Выборка.ПроизвольноеУсловие);		 
		 КонецЕсли; 
	 КонецЦикла;
	 
	 Возврат Неопределено;
КонецФункции // ПолучитьОграниченияДоступа()

Функция ЗаполнитьТаблицуДоступностиПоОграничению(Ограничение, НеПроверятьСтрокиУсловий = Ложь)
	ТД=Новый ТаблицаЗначений;
	
	ТД.Колонки.Добавить("ТипРаздела");
	ТД.Колонки.Добавить("ИмяРаздела");
	ТД.Колонки.Добавить("ИмяРеквизита");
	ТД.Колонки.Добавить("Полномочие");
	ТД.Колонки.Добавить("Доступность");
	ТД.Колонки.Добавить("Видимость");
	ТД.Колонки.Добавить("ВозможныеЗначения");
	ТД.Колонки.Добавить("ТолькоПросмотр");
	ТД.Колонки.Добавить("ИзменятьСоставСтрок");
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПраваДоступа.Роль КАК Роль,
	|	ПраваДоступа.Полномочие КАК Полномочие,
	|	ПраваДоступа.Доступность КАК Доступность,
	|	ПраваДоступа.Видимость КАК Видимость,
	|	НЕ ПраваДоступа.Редактирование КАК ТолькоПросмотр,
	|	НЕ ПраваДоступа.НеИзменятьСоставСтрок КАК ИзменятьСоставСтрок,
	|	ПраваДоступа.ЗагрузкаПриОбмене КАК ЗагрузкаПриОбмене,
	|	ПраваДоступа.ВозможныеЗначения КАК ВозможныеЗначения,
	|	Реквизиты.ТипРаздела КАК ТипРаздела,
	|	Реквизиты.ИмяРаздела КАК ИмяРаздела,
	|	Реквизиты.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	Справочник.НастройкиДоступа.ПраваДоступа КАК ПраваДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НастройкиДоступаРеквизиты.ТипРаздела КАК ТипРаздела,
	|			НастройкиДоступаРеквизиты.ИмяРаздела КАК ИмяРаздела,
	|			НастройкиДоступаРеквизиты.ИмяРеквизита КАК ИмяРеквизита,
	|			НастройкиДоступаРеквизиты.ИД_Строки КАК ИД_Строки
	|		ИЗ
	|			Справочник.НастройкиДоступа.Реквизиты КАК НастройкиДоступаРеквизиты
	|		ГДЕ
	|			НастройкиДоступаРеквизиты.Ссылка = &СсылкаНаПравило) КАК Реквизиты
	|		ПО ПраваДоступа.ИД_СтрокиРеквизитов = Реквизиты.ИД_Строки
	|ГДЕ
	|	ПраваДоступа.Ссылка = &СсылкаНаПравило
	|	И (ПраваДоступа.Роль = ""*.*""
	|			ИЛИ ПраваДоступа.Роль В (&ДоступныеРоли))
	|	" + ?(НеПроверятьСтрокиУсловий, "", "И ПраваДоступа.ИД_СтрокиУсловий = &ИД_СтрокиУсловий") + "
	|УПОРЯДОЧИТЬ ПО ПраваДоступа.НомерСтроки";
	
	ДоступныеРоли=Новый Массив;
	Для Каждого Роль Из Метаданные.Роли Цикл
		Если РольДоступна(Роль.Имя) Тогда
			ДоступныеРоли.Добавить(Роль.Имя);			
		КонецЕсли;			
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("СсылкаНаПравило",	Ограничение.СсылкаНаПравило);
	Запрос.УстановитьПараметр("ИД_СтрокиУсловий",	Ограничение.ИД_СтрокиУсловий);
	
	Запрос.УстановитьПараметр("ДоступныеРоли",		ДоступныеРоли);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		//контроль полномочий
		Если НЕ Выборка.Полномочие.Пустая() И НЕ ПолучитьПолномочиеПользователя(Выборка.Полномочие) Тогда Продолжить КонецЕсли;			
		
		СтрокаТД=ТД.Добавить();		
		ЗаполнитьЗначенияСвойств(СтрокаТД,Выборка);			
	КонецЦикла;
	
	Если ТД.Количество()=0 Тогда
		ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"*.*"				,,,Истина);	
	КонецЕсли; 
	
	Возврат ТД;	
КонецФункции //ЗаполнитьтаблицуДоступностиПоОграничению(Ограничение)
 
////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуДоступностиПолей(Форма = Неопределено, Объект = Неопределено, ТипФормы = "")
	
	СтруктураДоступности = Новый Структура("Ограничение, ТД");
	
	Если Форма <> Неопределено Тогда
		
		Если ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
			ЭтоФормаОбъекта = Истина;
			Объект = ДанныеФормыВЗначение(Форма.Объект, Тип(ТипФормы));
		ИначеЕсли ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЭтотОбъект") Тогда
			ЭтоФормаОбъекта = Истина;
			Объект = Форма.ЭтотОбъект;
		Иначе
			ЭтоФормаОбъекта = Ложь;
		КонецЕсли;
		
		Если НЕ ЭтоФормаОбъекта Тогда
			
			Если Форма.ЭлементыФормы.Найти("Список") <> Неопределено Тогда
				ЭтоФормаСписка = Истина;
				ИмяСписка = "Список";
			ИначеЕсли Форма.ЭлементыФормы.Найти("СправочникСписок") <> Неопределено Тогда
				ЭтоФормаСписка = Истина;
				ИмяСписка = "СправочникСписок";
			Иначе
				ЭтоФормаСписка = Ложь;
			КонецЕсли;
			
			Если ЭтоФормаСписка Тогда
				ТекДанные = Форма.ЭлементыФормы[ИмяСписка].ТекущиеДанные;
				Если ТекДанные <> Неопределено Тогда
					Объект = ТекДанные.Ссылка;
				Иначе
					СтруктураВозврата = ПолучитьИмяОбъектаМетаданныхПоИмениСписка(Форма[ИмяСписка]);
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ОбъектСсылка.Ссылка КАК Ссылка
					|ИЗ
					|" + СтруктураВозврата.ИмяОбъектаСтрокой + " КАК ОбъектСсылка
					|ГДЕ
					|	НЕ ОбъектСсылка.ПометкаУдаления
					|"+ ?(СтруктураВозврата.ЭтоСправочник = Истина, "И НЕ ОбъектСсылка.ЭтоГруппа", "") + "
					|";
					
					УстановитьПривилегированныйРежим(Истина);
					Выборка = Запрос.Выполнить().Выбрать();
					УстановитьПривилегированныйРежим(Ложь);
					
					Если Выборка.Следующий() Тогда
						Объект = Выборка.Ссылка;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НеПроверять = ?(Форма = Неопределено, Истина, Ложь);
	
	Ограничение = ПолучитьОграниченияДоступа(Объект);
			
	Если Ограничение <> Неопределено Тогда
		СообщениеОтладки("Ограничение доступа: "+Ограничение.ИД_СтрокиУсловий);
		СтруктураДоступности.Вставить("Ограничение", Ограничение);
		СтруктураДоступности.Вставить("ТД", ЗаполнитьТаблицуДоступностиПоОграничению(Ограничение,НеПроверять));
	Иначе
		СтруктураДоступности.Вставить("Ограничение", Неопределено);
		СтруктураДоступности.Вставить("ТД", ПолучитьТаблицуДоступностиПолей_Старая(Объект));
	КонецЕсли;
	
	Возврат СтруктураДоступности;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////
// Передаем: Объект, СтруктураПроверки
// Пример:
// СтруктураПроверки = Новый Структура;
// СтруктураПроверки.Вставить("Полномочие", Полномочие);
// СтруктураПроверки.Вставить("ТипУзла", ТипУзла);
//////////////////////////////////////////////////////////////////////////////////////////////////
Функция УстановитьОграниченияРеквизитовВМодулеОбъекта(Объект, СтруктураПроверки) Экспорт
	
	ПараметрыПроверки = Новый Соответствие;
	
	СтруктураВозврата = Новый Структура;
	
	Для Каждого Элемент ИЗ СтруктураПроверки Цикл
		
		Если Найти(Элемент.Ключ, "Полномочие") > 0 Тогда
			
			Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
				
				Успешно = ОбщегоНазначения_ПИ.СуществуетПолномочие(Элемент.Значение);
				
				Если НЕ Успешно Тогда
					Возврат СтруктураВозврата;
				КонецЕсли;
				
				Полномочие = ПланыВидовХарактеристик.ПолномочияПользователей[Элемент.Значение];
				
				Если Полномочие.Пустая() Тогда
					Возврат СтруктураВозврата;
				КонецЕсли;
				
				СтруктураПроверки.Вставить(Элемент.Ключ, Полномочие);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДоступностиПолей = ПолучитьТаблицуДоступностиПолей(Неопределено, Объект);
	ТД = СтруктураДоступностиПолей.ТД;
	Ограничение = СтруктураДоступностиПолей.Ограничение;
	
	Если Ограничение <> Неопределено Тогда
		СтруктураВозврата.Вставить("Ограничение", Ограничение);	
	КонецЕсли;
	
	// ПО УМОЛЧАНИЮ, ОТКАЗ = ИСТИНА
	Если ТД.Количество() = 0 Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Для Каждого Элемент ИЗ СтруктураПроверки Цикл
		
		НайденнаяСтрока = ТД.Найти(Элемент.Значение);
		Если НайденнаяСтрока <> Неопределено Тогда
			ПараметрыПроверки.Вставить(Элемент.Значение, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("ПараметрыПроверки", ПараметрыПроверки);
	
	Возврат СтруктураВозврата; // Отказ = Истина;
	
КонецФункции

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////

// старый вариант
Функция ДобавитьВТаблицуДоступности(ТД,ТипРаздела,ИмяРаздела,ИмяРеквизита,Доступность=Неопределено,ТолькоПросмотр=Неопределено,Видимость=Неопределено,
		ИзменятьСоставСтрок=Неопределено, Полномочие = Неопределено)
	СтрокаТД=ТД.Добавить();
	
	СтрокаТД.ИмяРеквизита		= ИмяРеквизита;
	СтрокаТД.ТипРаздела			= ТипРаздела;
	СтрокаТД.ИмяРаздела			= ИмяРаздела;
	СтрокаТД.Полномочие			= Полномочие;
	СтрокаТД.Доступность		= Доступность;
	СтрокаТД.ТолькоПросмотр		= ТолькоПросмотр;
	СтрокаТД.Видимость			= Видимость;	
	СтрокаТД.ИзменятьСоставСтрок= ИзменятьСоставСтрок;
	
КонецФункции // ДобавитьВТаблицуДоступности() 

Функция ПолучитьТаблицуДоступностиПолей_Старая(Объект = Неопределено)
	
	Если ТипЗнч(Объект) = Тип("Форма") Тогда
		ДокОбъект = Объект.ЭтотОбъект;
	Иначе
		ДокОбъект = Объект;
	КонецЕсли;
	
	Вид=ДокОбъект.Метаданные().Имя;	
	ЭтотУзел=ПланыОбмена.Основной.ЭтотУзел();
	
	ТД=Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ТипРаздела");
	ТД.Колонки.Добавить("ИмяРаздела");
	ТД.Колонки.Добавить("ИмяРеквизита");
	ТД.Колонки.Добавить("Полномочие", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПолномочияПользователей"));
	ТД.Колонки.Добавить("Доступность");
	ТД.Колонки.Добавить("Видимость");
	ТД.Колонки.Добавить("ТолькоПросмотр");
	ТД.Колонки.Добавить("ИзменятьСоставСтрок",Новый ОписаниеТипов("Булево"));
	ТД.Колонки.Добавить("ВозможныеЗначения");
		
	Если Вид="РасходнаяНакладная" ИЛИ Вид="Перемещение" Тогда		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ИнтегральнаяИБ Тогда			
		ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если РольДоступна("Администратор") Тогда
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда						
				Если ДокОбъект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе Тогда
						
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"*.*"				,,,Истина);					
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"Контрагент"		,,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"ЛевыйКонтрагент"	,,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"Договор"			,,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"ПунктДоставки"		,,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"СкладПолучатель"	,,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"Реквизиты",	"Комментарий"		,,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Шапка"	,	"ЭУ",			"тЦеныВалюта"		,,,Ложь);
					
					ДобавитьВТаблицуДоступности(ТД,"ТЧ"		,	"Товары",		"*.*"				,,Истина);					
					ДобавитьВТаблицуДоступности(ТД,"ТЧ"		,	"Товары",		"Цена"				,,,Ложь);
				КонецЕсли;
			Иначе
			КонецЕсли;			
		ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") Тогда				
			ИначеЕсли РольДоступна("ОператорОфис") Тогда						
			ИначеЕсли РольДоступна("ОператорСклад") Тогда
				//шапка
				ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"*.*"				,,,Истина);
				ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"Комментарий"		,,,Ложь);
				ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"Отгружен"			,,,Ложь);
				ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"СостояниеНакладной",,,Ложь);
				ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"Дата"				,,,Ложь);
				ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"ДатаОтгрузки"		,,,Ложь);
				
				//ТЧ Товары				
				ДобавитьВТаблицуДоступности(ТД,"ТЧ"			,	"Товары"	,	"*.*"				,,Истина,,Ложь);				
				ДобавитьВТаблицуДоступности(ТД,"ТЧ"			,	"Товары"	,	"Количество"		,,Ложь);				
			Иначе                                                           
			КонецЕсли;	
		КонецЕсли;		
	ИначеЕсли Вид="ПриходнаяНакладная" Тогда
		//ДобавитьВТаблицуДоступности(ТД,ИмяРеквизита,ИмяТЧ="",Доступность=Неопределено,ТолькоПросмотр=Неопределено,Видимость=Неопределено,ИзменятьСоставСтрок=Неопределено)
		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ИнтегральнаяИБ Тогда			
		ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если РольДоступна("Администратор") Тогда
			ИначеЕсли РольДоступна("Менеджер") ИЛИ РольДоступна("ОператорОфис") Тогда						
				Если ДокОбъект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе Тогда
					ДобавитьВТаблицуДоступности(ТД,"__Все",,,Истина);					
					ДобавитьВТаблицуДоступности(ТД,"Контрагент",,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"ЛевыйКонтрагент",,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Договор",,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"ПунктДоставки",,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"Комментарий",,,Ложь);
					ДобавитьВТаблицуДоступности(ТД,"тЦеныВалюта",,,Ложь);
					
					ДобавитьВТаблицуДоступности(ТД,"__Все","Товары",,Истина);					
					ДобавитьВТаблицуДоступности(ТД,"Цена","Товары",,Ложь,);
				КонецЕсли;
			Иначе
			КонецЕсли;			
		ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
			Если РольДоступна("Администратор") Тогда		
			ИначеЕсли РольДоступна("Менеджер") Тогда				
			ИначеЕсли РольДоступна("ОператорОфис") Тогда						
			ИначеЕсли РольДоступна("ОператорСклад") Тогда
				//ТЧ Товары				
				ДобавитьВТаблицуДоступности(ТД,"__Все","Товары",,Истина,);
				ДобавитьВТаблицуДоступности(ТД,"__ИзменятьСоставСтрок","Товары",,,,Ложь);
				ДобавитьВТаблицуДоступности(ТД,"Количество","Товары",,Ложь,);								
				
				//шапка
				ДобавитьВТаблицуДоступности(ТД,"__Все",,,Истина,);
				ДобавитьВТаблицуДоступности(ТД,"Комментарий",,,Ложь,);
				ДобавитьВТаблицуДоступности(ТД,"Отгружен",,,Ложь,);
				ДобавитьВТаблицуДоступности(ТД,"СостояниеНакладной",,,Ложь,);
				ДобавитьВТаблицуДоступности(ТД,"Дата",,,Ложь,);
				ДобавитьВТаблицуДоступности(ТД,"ДатаОтгрузки",,,Ложь,);				
			Иначе
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;

	
	Если ТД.Количество()=0 Тогда
		ДобавитьВТаблицуДоступности(ТД,"Шапка"		,	"Реквизиты"	,	"*.*"				,,,Истина);	
	КонецЕсли; 
	
	Возврат ТД;
КонецФункции // ПолучитьНедоступныеПоля()

 
Функция ПроверкаДоступаККассовомуДокументу(Форма) Экспорт
	Отказ			= Ложь;
	ТолькоПросмотр	= Форма.ТолькоПросмотр;
	Описание		= "";
	
	ДокОбъект		= Форма.ЭтотОбъект;
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ВидДокумента=ДокОбъект.Метаданные().Имя;
		
		Если ВидДокумента="ДвиженияДенежныхСредств" Тогда
			ИмяРеквизитаКассы="БанковскийСчет";
		ИначеЕсли ВидДокумента="ПереводСредств" Тогда
			ИмяРеквизитаКассы="Источник_Касса";
		Иначе
			ИмяРеквизитаКассы="Касса";			
		КонецЕсли;		
		
		Касса	= ДокОбъект[ИмяРеквизитаКассы];
		Если Касса=Неопределено Тогда Возврат НЕ Отказ КонецЕсли; 
		
		Если Касса.ПраваДоступа.Количество()>0 Тогда			
			СтрокаДК=Касса.ПраваДоступа.Найти(ПараметрыСеанса.Пользователь,"Пользователь");
			Если СтрокаДК=Неопределено ИЛИ СтрокаДК.ПросмотрДокументов=Ложь Тогда
				Отказ	=Истина;
				Описание="Недостаточно прав доступа на просмотр документов по данной кассе !";
			Иначе			
				Если НЕ СтрокаДК.РедактированиеДокументов Тогда
					ТолькоПросмотр	=Истина;
					Описание		="Недостаточно прав доступа для изменения документов по данной кассе !";			
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокОбъект.Автор<>ПараметрыСеанса.Пользователь И НЕ ПолучитьПолномочиеПользователя("РедактированиеЧужихВыписок") И НЕ Отказ И НЕ ТолькоПросмотр Тогда		
		ТолькоПросмотр	= Истина;	
		Описание		= Описание+?(ЗначениеЗаполнено(Описание),Символы.ПС,"")+"Недостаточно прав для изменения документов созданных другим пользователем !";			
	КонецЕсли;
	
	Форма.ТолькоПросмотр=ТолькоПросмотр;
	
	Если ЗначениеЗаполнено(Описание) Тогда
		#ЕСЛИ КЛИЕНТ ТОГДА
		Предупреждение(Описание);
		#КОНЕЦЕСЛИ
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции//ПроверкаДоступаККассовомуДокументу(ДокОбъект,Отказ)

//Катаев+ 02/04/14
Функция ЕстьБлокировкаНоменклатуры(Накладная,ИмяТЧ="Товары") Экспорт
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда Возврат Ложь КонецЕсли;
	//++Данилова Е.В. 28.01.2026  SNL-109
	
	ИмяОбъекта = Накладная.Метаданные().Имя; 
	ВидыОбъектовИсключения = Новый Массив;
	ВидыОбъектовИсключения.Добавить("Комплектация"); 
	ВидыОбъектовИсключения.Добавить("ПланНабора");
	ВидыОбъектовИсключения.Добавить("РасходнаяНакладная");
	ВидыОбъектовИсключения.Добавить("Перемещение");
	
	Если ВидыОбъектовИсключения.Найти(ИмяОбъекта) <> Неопределено Тогда
	
		Возврат Ложь; 	
	
	КонецЕсли;
	//--Данилова Е.В. 28.01.2026
	 
	Запрос 			= Новый Запрос;
	//++Данилова Е.В. 28.01.2026
	//Запрос.Текст 	= "
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Номенклатура	
	//|ПОМЕСТИТЬ СписокЗаблокированнойНоменклатуры
	//|ИЗ
	//|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК БлокировкаВыдачиВНаборНоменклатура
	//|ПОЛНОЕ СОЕДИНЕНИЕ 
	//|	Документ.БлокировкаВыдачиВНабор.Склады КАК БлокировкаВыдачиВНаборСклады
	//|ПО 
	//|	БлокировкаВыдачиВНаборНоменклатура.Ссылка = БлокировкаВыдачиВНаборСклады.Ссылка
	//|ГДЕ
	//|	БлокировкаВыдачиВНаборСклады.Склад = &Склад
	//|	И БлокировкаВыдачиВНаборНоменклатура.Ссылка.Активен
	//|ИНДЕКСИРОВАТЬ ПО 
	//|	Номенклатура
	//|;
	//|ВЫБРАТЬ
	//|	Номенклатура
	//|ИЗ
	//|	Документ."+Накладная.Метаданные().Имя+"."+ИмяТЧ+"
	//|ГДЕ
	//|	Ссылка=&Ссылка
	//|	И Количество>0
	//|	И Номенклатура В ИЕРАРХИИ (ВЫБРАТЬ Номенклатура ИЗ СписокЗаблокированнойНоменклатуры)
	//|";
	
	Запрос.Текст 	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ СписокЗаблокированнойНоменклатуры
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&ТекущаяДата, Склад = &Склад ИЛИ Склад = &СкладФизСклад) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ."+Накладная.Метаданные().Имя+"."+ИмяТЧ+" КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяТовары.Количество > 0
	|	И РасходнаяНакладнаяТовары.Номенклатура В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				СписокЗаблокированнойНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокЗаблокированнойНоменклатуры)";

	
	
	Запрос.УстановитьПараметр("Склад",	ПолучитьРеквизитыШапки(Накладная,Новый Структура("Склад")).Склад);
	запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("СкладФизСклад",	ПолучитьРеквизитыШапки(Накладная,Новый Структура("Склад")).Склад.ФизическийСклад);
	//--Данилова Е.В. 28.01.2026
	Запрос.УстановитьПараметр("Ссылка",	Накладная);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Возврат (Выборка.Количество() > 0);	
КонецФункции
//Катаев- 02/04/14
//Кухарь 23.04.14 начало
Функция ПроверитьБлокировкуВыдачейВНабор (ДокОбъект) Экспорт 
		//ДокОбъект=Документы.РасходнаяНакладная.НайтиПоНомеру().ПолучитьОбъект();
	
	Запрос=новый запрос;
	Запрос.Текст=	
 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
 	|	БлокировкаВыдачиВНаборНоменклатура.Номенклатура,
 	|	БлокировкаВыдачиВНаборСклады.Склад,
 	|	БлокировкаВыдачиВНаборСостоянияЗапрета.Состояние КАК СостояниеБлокировки,
 	|	БлокировкаВыдачиВНаборСостоянияРезервирования.Состояние КАК СостояниеРезервирования
 	|ИЗ
 	|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК БлокировкаВыдачиВНаборНоменклатура
 	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.Склады КАК БлокировкаВыдачиВНаборСклады
 	|		ПО БлокировкаВыдачиВНаборНоменклатура.Ссылка = БлокировкаВыдачиВНаборСклады.Ссылка
 	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.СостоянияЗапрета КАК БлокировкаВыдачиВНаборСостоянияЗапрета
 	|		ПО БлокировкаВыдачиВНаборНоменклатура.Ссылка = БлокировкаВыдачиВНаборСостоянияЗапрета.Ссылка
 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.СостоянияРезервирования КАК БлокировкаВыдачиВНаборСостоянияРезервирования
 	|		ПО БлокировкаВыдачиВНаборНоменклатура.Ссылка = БлокировкаВыдачиВНаборСостоянияРезервирования.Ссылка
 	|ГДЕ
 	|	БлокировкаВыдачиВНаборСклады.Склад = &Склад
 	|	И БлокировкаВыдачиВНаборНоменклатура.Ссылка.Активен
 	|	И БлокировкаВыдачиВНаборНоменклатура.Номенклатура В(&Номенклатура)";
	Запрос.УстановитьПараметр("Склад", ДокОбъект.Склад);
	Запрос.УстановитьПараметр("Номенклатура", ДокОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		Список=результат.Скопировать();
		Список.Свернуть("СостояниеРезервирования");
		Возврат Список;		
	иначе
		 возврат Неопределено
	КонецЕсли;


 КонецФункции
//Кухарь 23.04.14 конец 

//Кухарь 28.11.19 начало
//Вернул старую процедуру на место. Буду её использовать для документов с которыми работают напрямую (без ЛН и других подчинённых)
Функция ПроверитьБлокировкуНоменклатуры(ТЧ_Товары, Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборНоменклатура.Номенклатура,
	|	БлокировкаВыдачиВНаборСклады.Склад
	|ИЗ
	|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК БлокировкаВыдачиВНаборНоменклатура
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.Склады КАК БлокировкаВыдачиВНаборСклады
	|		ПО БлокировкаВыдачиВНаборНоменклатура.Ссылка = БлокировкаВыдачиВНаборСклады.Ссылка
	|ГДЕ
	|	БлокировкаВыдачиВНаборСклады.Склад = &Склад
	|	И БлокировкаВыдачиВНаборНоменклатура.Ссылка.Активен";
	Запрос.УстановитьПараметр("Склад", Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		сз = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Номенклатура);
		КонецЦИкла;
		сз1 = Новый СписокЗначений;
		Для Каждого стр из ТЧ_Товары Цикл
			сз1.Добавить(стр.Номенклатура);
		КонецЦикла;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&сзЗаблокированныхНоменклатур)
		|	И Номенклатура.Ссылка В ИЕРАРХИИ(&сзПереданныхНоменклатур)";
		Запрос.УстановитьПараметр("сзЗаблокированныхНоменклатур", сз);
		Запрос.УстановитьПараметр("сзПереданныхНоменклатур", сз1);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
КонецФункции
//Кухарь 28.11.19 конец

Функция ПолучитьИмяОбъектаМетаданныхПоИмениСписка(Знач ИмяСписка) Экспорт
	
	СтруктураВозврата = Новый Структура("ИмяОбъектаСтрокой, ЭтоСправочник, ЭтоДокумент", "", Ложь, Ложь);
	
	ИмяСпискаСтрокой = СокрЛП(ИмяСписка);
	
	ЭтоСправочник = Ложь; ЭтоДокумент = Ложь;
	
	Если Найти(ИмяСпискаСтрокой, "Справочник") > 0  Тогда
		ИмяОбъектаСтрокой = "Справочник.";
		СтруктураВозврата.Вставить("ЭтоСправочник", Истина);
	ИначеЕсли Найти(ИмяСпискаСтрокой, "Документ") Тогда
		ИмяОбъектаСтрокой = "Документ.";
		СтруктураВозврата.Вставить("ЭтоДокумент", Истина);
	КонецЕсли;
	
	ПозицияТочки = Найти(ИмяСпискаСтрокой, ".");
	ИмяОбъекта = Прав(ИмяСпискаСтрокой, СтрДлина(ИмяСпискаСтрокой) - ПозицияТочки);
	
	ИмяОбъектаСтрокой = ИмяОбъектаСтрокой + ИмяОбъекта;
	СтруктураВозврата.Вставить("ИмяОбъектаСтрокой", ИмяОбъектаСтрокой);
	
	Возврат СтруктураВозврата;
	
КонецФункции
